app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all.order("created_at DESC")
    @users = User.all
---
SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC
SELECT "users".* FROM "users"

  def create
    @tweet = current_user.tweets.build(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("tweet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweet", "Tweeting as a test from a second account."], ["created_at", "2020-04-23 20:29:50.712697"], ["updated_at", "2020-04-23 20:29:50.712697"], ["user_id", 3]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "tweet" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["tweet", "This is a user-generated tweet"], ["updated_at", "2020-04-23 20:31:35.592145"], ["id", 5]]